# Pandas

## Import pandas after `pip install pandas`

In [1]:
import pandas as pd

## Import **.csv** file

In [2]:
df = pd.read_csv("./mystudents.csv")
df

    Student ID    Name  Age   Score Grade       Province
0   5010110405    Jane   31   53.75     D        Songkla
1   5110110580     Joe   32   37.65     E        Bangkok
2   6310110042     Dan   19  ขาดสอบ   NaN      Chiangmai
3   6310110073    Tida   18      65    C+        Bangkok
4   6310110076    Jane   21      62     C           Yala
5   6310110092   Smile   20    60.5     C      Chiangrai
6   6310110107    Cole   18     NaN   NaN         Phuket
7   6310110109   Tommy   19   51.75     D        Bangkok
8   6310110145   Jerry   19   64.75     C            Nan
9   6310110147    Anna   18   28.25     E          Krabi
10  6310110150   Scott  -15    24.5     E      Ang Thong
11  6310110243     Utz   20   56.25    D+        Kalasin
12  6310110250    Rome   19   17.25     E   Kanchanaburi
13  6310110251   Ronda   18   59.63    D+        Lampang
14  6310110260   Wanda   21    54.5     D        Bangkok
15  6310110349    Nita   20   32.75     E   Mae Hong Son
16  6310110363    Nida   18      50     D           Loei
17  6310110383    Swat   19    88.5     A  Nakhon Pathom
18  6310110389     Tim   19   29.38     E        Bangkok
19  6310110401  Andrew   18   75.13     B        Bangkok

In [3]:
df.head()

   Student ID  Name  Age   Score Grade   Province
0  5010110405  Jane   31   53.75     D    Songkla
1  5110110580   Joe   32   37.65     E    Bangkok
2  6310110042   Dan   19  ขาดสอบ   NaN  Chiangmai
3  6310110073  Tida   18      65    C+    Bangkok
4  6310110076  Jane   21      62     C       Yala

In [4]:
df.tail()

    Student ID    Name  Age  Score Grade       Province
15  6310110349    Nita   20  32.75     E   Mae Hong Son
16  6310110363    Nida   18     50     D           Loei
17  6310110383    Swat   19   88.5     A  Nakhon Pathom
18  6310110389     Tim   19  29.38     E        Bangkok
19  6310110401  Andrew   18  75.13     B        Bangkok

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Student ID  20 non-null     int64
 1   Name        20 non-null     object
 2   Age         20 non-null     int64
 3   Score       19 non-null     object
 4   Grade       18 non-null     object
 5   Province    20 non-null     object
dtypes: int64(2), object(4)
memory usage: 1.1+ KB

In [6]:
df.describe()

         Student ID        Age
count  2.000000e+01  20.000000
mean   6.185110e+09  18.600000
std    3.850836e+08   8.834144
min    5.010110e+09 -15.000000
25%    6.310110e+09  18.000000
50%    6.310110e+09  19.000000
75%    6.310110e+09  20.000000
max    6.310110e+09  32.000000

In [7]:
df.index

RangeIndex(start=0, stop=20, step=1)

In [8]:
df.columns

Index(['Student ID', 'Name', 'Age', 'Score', 'Grade', 'Province'], dtype='object')

In [9]:
df.dtypes

Student ID     int64
Name          object
Age            int64
Score         object
Grade         object
Province      object
dtype: object

In [10]:
df.values

array([[5010110405, 'Jane', 31, '53.75', 'D', 'Songkla'],
       [5110110580, 'Joe', 32, '37.65', 'E', 'Bangkok'],
       [6310110042, 'Dan', 19, 'ขาดสอบ', nan, 'Chiangmai'],
       [6310110073, 'Tida', 18, '65', 'C+', 'Bangkok'],
       [6310110076, 'Jane', 21, '62', 'C', 'Yala'],
       [6310110092, 'Smile', 20, '60.5', 'C', 'Chiangrai'],
       [6310110107, 'Cole', 18, nan, nan, 'Phuket'],
       [6310110109, 'Tommy', 19, '51.75', 'D', 'Bangkok'],
       [6310110145, 'Jerry', 19, '64.75', 'C', 'Nan'],
       [6310110147, 'Anna', 18, '28.25', 'E', 'Krabi'],
       [6310110150, 'Scott', -15, '24.5', 'E', 'Ang Thong'],
       [6310110243, 'Utz', 20, '56.25', 'D+', 'Kalasin'],
       [6310110250, 'Rome', 19, '17.25', 'E', 'Kanchanaburi'],
       [6310110251, 'Ronda', 18, '59.63', 'D+', 'Lampang'],
       [6310110260, 'Wanda', 21, '54.5', 'D', 'Bangkok'],
       [6310110349, 'Nita', 20, '32.75', 'E', 'Mae Hong Son'],
       [6310110363, 'Nida', 18, '50', 'D', 'Loei'],
       [6310110383, 'Swat', 19, '88.5', 'A', 'Nakhon Pathom'],
       [6310110389, 'Tim', 19, '29.38', 'E', 'Bangkok'],
       [6310110401, 'Andrew', 18, '75.13', 'B', 'Bangkok']], dtype=object)

In [11]:
df.empty

False

In [12]:
df.shape

(20, 6)

In [13]:
df.size

120

In [14]:
df["Name"]
df.Name

0       Jane
1        Joe
2        Dan
3       Tida
4       Jane
5      Smile
6       Cole
7      Tommy
8      Jerry
9       Anna
10     Scott
11       Utz
12      Rome
13     Ronda
14     Wanda
15      Nita
16      Nida
17      Swat
18       Tim
19    Andrew
Name: Name, dtype: object

In [15]:
df.get("Name")

0       Jane
1        Joe
2        Dan
3       Tida
4       Jane
5      Smile
6       Cole
7      Tommy
8      Jerry
9       Anna
10     Scott
11       Utz
12      Rome
13     Ronda
14     Wanda
15      Nita
16      Nida
17      Swat
18       Tim
19    Andrew
Name: Name, dtype: object

In [16]:
df[["Name", "Age"]]

      Name  Age
0     Jane   31
1      Joe   32
2      Dan   19
3     Tida   18
4     Jane   21
5    Smile   20
6     Cole   18
7    Tommy   19
8    Jerry   19
9     Anna   18
10   Scott  -15
11     Utz   20
12    Rome   19
13   Ronda   18
14   Wanda   21
15    Nita   20
16    Nida   18
17    Swat   19
18     Tim   19
19  Andrew   18

In [17]:
df[0:2]

   Student ID  Name  Age  Score Grade Province
0  5010110405  Jane   31  53.75     D  Songkla
1  5110110580   Joe   32  37.65     E  Bangkok

In [18]:
df[0:6:2]

   Student ID  Name  Age   Score Grade   Province
0  5010110405  Jane   31   53.75     D    Songkla
2  6310110042   Dan   19  ขาดสอบ   NaN  Chiangmai
4  6310110076  Jane   21      62     C       Yala

In [19]:
df[0:10:3]

   Student ID  Name  Age  Score Grade Province
0  5010110405  Jane   31  53.75     D  Songkla
3  6310110073  Tida   18     65    C+  Bangkok
6  6310110107  Cole   18    NaN   NaN   Phuket
9  6310110147  Anna   18  28.25     E    Krabi

In [20]:
df.at[0, "Name"]

'Jane'

In [21]:
df.at[4, "Province"]

'Yala'

In [22]:
df.iat[4, 5]

'Yala'

In [23]:
# location
df.loc[[0, 1]]

   Student ID  Name  Age  Score Grade Province
0  5010110405  Jane   31  53.75     D  Songkla
1  5110110580   Joe   32  37.65     E  Bangkok

In [24]:
df.loc[[11, 2, 5]]

    Student ID   Name  Age   Score Grade   Province
11  6310110243    Utz   20   56.25    D+    Kalasin
2   6310110042    Dan   19  ขาดสอบ   NaN  Chiangmai
5   6310110092  Smile   20    60.5     C  Chiangrai

## Create DataFrame from dictionary

In [25]:
# Create dict object
student_dict = {
    "name": ["Joe", "Nat", "Harry"],
    "age": [20, 21, 19],
    "marks": [85.10, 77.80, 91.54],
}

# Create DataFrame from dict
student_df = pd.DataFrame(student_dict, index=["R0", "R1", "R2"])
student_df

     name  age  marks
R0    Joe   20  85.10
R1    Nat   21  77.80
R2  Harry   19  91.54

In [26]:
student_df.loc[["R2", "R1"]]

     name  age  marks
R2  Harry   19  91.54
R1    Nat   21  77.80

In [27]:
# index location
student_df.iloc[[2, 1]]

     name  age  marks
R2  Harry   19  91.54
R1    Nat   21  77.80

In [28]:
student_df.loc[["R0", "R1"], ["age", "marks"]]

    age  marks
R0   20   85.1
R1   21   77.8

In [29]:
student_df.loc[["R1", "R0"], ["name", "marks"]]

   name  marks
R1  Nat   77.8
R0  Joe   85.1